package net.december1900.douby.common.model;

/**
 * Created by december on 22/10/2017.
 */

public class Comment {


    /**
     * comment :
     又看《霸王别姬》，不一样的环境，一样的感动。
     有几大矛盾对象：
     程蝶衣与段小楼
     蝶衣从最开始近京剧班，就与小楼有着很深厚的感情。我们可以看到许多感人的画面：小楼受罚，黑夜冬天在院子了跪着，蝶衣则隔着窗子心疼地看着他，等小楼回来后则自己光着身子，却把被子给小楼裹上。接着那个他们依偎在一起睡觉的场面大家一定很难忘记，蝶衣紧紧地搂着小楼，仿佛怕失去了他。而小楼对蝶衣也是身份的爱护，他开始知道蝶衣不想学京戏了，那一次，他却把蝶衣放走了，尽管他十分的不舍的。还有后来让老板来，听蝶衣总唱不好“我本是女娇娥”，就用烟斗烫他，从而使蝶衣第一次唱对。
     毋庸置疑，他们都是相互喜欢的，但是，小楼对蝶衣只是好兄弟一样的感情，而蝶衣对小楼则超越了亲情。由于总在戏中扮演青衣，唱的是女腔，学得是女形，久而久之，在社会及角色中，他则比较倾向于女性。对小楼，他也一直是以一个女性的角色，例如帮小楼舔伤口，给小楼画脸谱，其亲昵的动作无不体现出他对小楼的超出一般的感情。尤其是在出现了菊仙以后，他对菊仙的嫉妒和对小楼的怨恨，都很明显的变现了他社会角色中女性化的特点。
     程蝶衣与小癞子
     小癞子给蝶衣留下的最深的印象，莫过于一句话：“等以后我成角儿了就天天吃糖葫芦”和一个场景了“最后因为害怕被师傅毒打，而上吊自杀。”他的自杀是有准备的，由于看着蝶衣被打的恐怖的场面，或许还由于他觉得成为一个角儿还要挨很多很疼的打而觉得害怕？总之，他有准备的自杀了，死之前他把自己身上所有的吃的东西都急急忙忙的吞了下去。这也许是许多学京戏却没有成角儿的人的另一种选择吧。梦不能成真，就只有在虚无的世界中去寻找了。
     但他却留给蝶衣一生的印象。在蝶衣成角儿后，一次入场前他听到了冰糖葫芦的吆喝声，就愣住了。那时候，他想到了什么呢？小癞子的梦想？小癞子的死？或许是震惊和无奈？
     程蝶衣与张公公
     张公公玷污了蝶衣。成了角儿，也并不一定只是荣誉和欢乐。他们或许还不知道，开始只是拼命的向前奔，可后来等达到了目标，却才发现这结果也许并不是美好的，可却，只能接受而不能改变了。
     讽刺的是，后来的新中国成立前夕，曾经呼风唤雨，为所欲为的太监，张公公，却成了一个买烟的贫苦的老人，并且已经神智不清，只知道买烟的人。他曾干过的一切，就在他的混沌中被遗忘了吗？可是受到伤害的人，却是一生的无法挽回的创痛。社会中人与人之间，一件事也许对一个人来说微乎其微，何时对另一个人来讲也许是决定性的。
     程蝶衣与菊仙（妈妈）
     从一开始蝶衣对菊仙就充满了敌意，嫉妒，因为她抢走了小楼，一个蝶衣生命中最最重要的人。他们之间也许存在着一场战斗，而蝶衣注定是失败者。
     可是，在一幕幕蝶衣与菊仙的对视中，他有对蝶衣有一定的依恋，是一种对于母亲的依恋。尤其在他戒毒瘾时菊仙抱着他哄他睡觉更表现得淋漓尽致。蝶衣从小就被妈妈送到京戏班，连妈妈的最后一眼，那个空荡荡的没有人影的门，都没有看到。因此他对母爱是渴望的。并且菊仙和蝶衣妈妈得出身一样，都是妓女，更给他一种幻象，菊仙有着他妈妈的众多特性，女性，泼辣，妓女。
     因此他对菊仙的感情就非常的矛盾了，在敌视与依恋中徘徊。
     程蝶衣与袁四爷
     也许袁四爷是他的知音，在京戏方面。他在蝶衣失去小楼的最痛苦的时候，让蝶衣产生了幻觉。他很欣赏蝶衣，他也给过蝶衣很多的帮助，各个方面。但小楼对他是充满敌意的，也许是因为他对蝶衣的特殊的关照也令小楼嫉妒了？但他的命运让小楼和蝶衣都很惊讶，一个社会上游刃有余的名流，终会遇到一种无法逍遥自在的社会。他就那么的死了，被历史碾死了。
     程蝶衣与小四
     蝶衣捡来了小四，在师傅死后，又收养了小四。他是想让小四延续京剧的发展。可时候来，小四却无情的将蝶衣打下了地狱。他抢占了蝶衣的上台的机会，他抢占了虞姬的角色。而对于蝶衣，一个把京剧视为生命，甚至比生命还重要的人，如果连京戏都被剥夺了，那他还能剩下什么呢？
     程蝶衣与京戏（师傅）
     师傅把蝶衣领进了京剧的世界，一个严厉的，传统的，却对京剧充满理解的师傅，他最终在唱京剧时倒下了，辞世了。无疑，他给了蝶衣很大的影响。蝶衣慢慢的从只知其声，其形，到了解其中的精粹，最终把其视为生命。他在表演时非常的入境，常到达一种与戏中的人物和一的境界。那种潜心投入的表演，一切外在的喧闹和烦扰都不能够影响。
     程蝶衣与时代（清末，侵华，民国，新中国初期，文化大革命，之后）
     一个动荡的年代，人们的思想也是非常慌乱的，不确定的。连国家，民族，你都不能确信，你就更不能确信任何其他的一切了。人们仿佛都是漂浮在空气中的，没有根基。善于生活的人也不一定能够生（比如袁四爷），懂得人生常识的人也不一定能够生，（比如菊仙）。
     清末，百姓，戏子，被动得像旗子一样受封建残余的玩弄，不能把握自己的命运。
     日寇来了，无辜的人们的姓名也不能幸免。或许艺术能够无国界，可是舆论却不能够接受，民族感情不能接受。
     民国呢，仍然是动荡不安，随时都回发生变动。
     短暂的新中国初期，对于京剧形式的变形，蝶衣很难接受，毕竟，那不是他心中的京剧的印象。可是他不能决定一切，因为时间的车轮在不停的转着。
     他一直都在唱着，不管是哪一个时期，或许，每个时期都需要艺术。艺术没有时间性。可是，在这其中蝶衣总要时不时地受到外界的干扰，政治，一个无聊的却无法避免的东西，在艺术前进的道路上洒满了图钉。
     文化大革命来了，一切真的都颠覆了？革文化的命，对文化进行批判，打破固有的一切文化。或许如果这只在学术界进行，只是行而上的批判是好的，可是当权力掌握在了不成熟的头脑发热的人的手中，也许就变味了。没有了文化，没有了标准，没有了历史，每个人都可以是他想是的了，最终，也就什么都不是了。
     程蝶衣与死
     蝶衣真的累了，经历了那么多辉煌与动荡，得到，失去，又得到。最终，他选择了在戏中结束自己的生命。一生都无法把握住自己，一生都宿命的漂泊，终在死亡这件事上他做了自己的主人。一幅完美的画面——霸王别姬，永不能重演了。留下了孤零零的楚霸王，人生，也许真的只是一场戏。爱，别，离，怨，憎，恚，总得有一个苦涩的结局来收场。
     程蝶衣与张国荣
     虞姬死了，呈蝶衣死了，张国荣死了。戏里戏外，真真假假，可是，结果都一样。

     * rate1 : 5.05
     * rate2 : 9.09
     * rate3 : 35.35
     * rate4 : 51.51
     */

    public String comment;
    public double rate1;
    public double rate2;
    public double rate3;
    public double rate4;
}
